{
  "changes": [
    {
      "timestamp": 1668744387,
      "change_description": "**2.5b**\n\n**General**\n\n- Can now view damage bars for the final round when the game ends\n- Rainbow Hat fixed\n- Updated Russian localization\n- Updated  Chinese localization\n\n**Gods**\n\n- Tower God: Fixed many abilities not being cast by a Tower unit (Burning Barrage, Plague Wards and others)\n\n**Spells**\n\n- Duel duration from 6\/8\/10 to 4\/6\/8\n- Enchant Totem fixed to consume the charge when using Trample\n- Enchant Totem Super replaced with the current Gaben (-1.5s cooldown and becomes passive)\n- Enchant Totem Gaben replaced with \"Gives Daedalus\"\n- Eye of the Storm is no longer dispellable\n- Infernal Blade fixed to actually break",
      "language": 0
    },
    {
      "timestamp": 1668455310,
      "change_description": "[url=https:\/\/abilityarena.com\/changelog] View full changelog  [\/url]\n\n**General**\n\n- You can now view all the spells in the game with filters on our website (https:\/\/abilityarena.com\/learn\/spells). Credit to JackFlapper who made this as part of the community and is now on our team!\n- Starting gold changed from 4 to 6 (shop upgrade cost increased to compensate)\n- XP Bundle prices have been reduced by roughly 50%\n- Rune God Finisher now has sound\n\n**Gods**\n\n- Added Tower God (Unlocked for free)\nAbility: Building\nType: Single Target\n\nDescription: Once the battle begins, the selected unit cannot move and is rooted, while its attack range is set to a minimum of 750. This root is disabled if you are the last allied hero alive or you are facing a fellow Tower God. Activating this ability will enable your Glyph of Fortification Passive.\n\nAbility: Glyph of Fortification\nType: Passive\n\nDescription: When a hero dies, all remaining heroes become immune to any kind of damage for 1.5 seconds. This ability is only active if you are using the Building ability, and your Building unit is alive.\n\n- Aghanim upgrade chance changed from 30\/35\/40\/45\/50 to 25\/30\/35\/40\/45%\n- Bloodseeker: lifesteal from 17.5 to 25%\n- Bloodseeker: Affected unit will physically get larger with each ally hero that dies\n- Dazzle: Shallow Grave shop scaling changed from 0.8\/1.6\/2.4\/3.2\/4 to 1\/2\/3\/4\/4 + 250HP heal\n- Phantom Assassin: Critical strike from 3.5% to 2.0%\n- Phantom Assassin: Distance to damage from 12 to 15\n- Sorla Khan: Team damage buff from 10% to 8%\n- Sorla Khan: Extra God damage from 4% per surviving unit to 2%\n\n**Spells**\n\n- Benched Nethertoxin\n- Added Duel\n- Berserker's Blood health regen from 25\/40\/55\/70 to 15\/30\/45\/60\n- Borrowed Time duration from 1\/2\/3 to 1\/1.5\/2\n- Burning Barrage cooldown from 20\/16\/12\/8 to 22\/18\/14\/10\n- Burning Barrage damage from 50\/55\/60\/65 to 40\/45\/50\/55\n- Burning Barrage Super damage from 25% to 35%\n- Chaotic Offering manacost from 300\/400\/500 to 300\/450\/600\n- Chemical Rage BAT for melee increased from 1.2\/1.1\/1.0 to 1.3\/1.2\/1.1\n- Chronosphere will now cast on magic immune units (would ignore previously)\n- Elder Dragon Form splash (non Black Dragon) from 75% to 60%\n- Empower Super now also grants +200 Cleave Radius\n- Epicenter damage increased from 60\/80\/100 to 80\/100\/120\n- Familiar AI only stuns when they drop below 90% HP\n- Frost Shield duration from 4\/5\/6\/7 to 3\/4\/5\/6\n- Frost Shield Super duration from 1s to 0\n- Heavenly Grace no longer grants Status Resistance by default\n- Heavenly Grace Super now also grants 50% Status Resistance\n- Infernal Blade now breaks by default\n- Kraken Shell reduction from 16\/34\/52\/70 to 12\/24\/36\/48\n- Kraken Shell Super reduction from +30 to +40\n- Leech Seed Gaben now allows Leech Seed to be recast on the same unit more than once\n- Multishot attack range multiplier from 1.75x to 2x\n- Multishot CD from 26\/24\/22\/20 to 24\/20\/16\/12\n- Multishot Super no longer has any cooldown reduction\n- Multishot Super now also grants +2 arrows per wave\n- Overcharge Super will no longer buff illusions\n- Reactive Armor max stacks from 10\/20\/30\/40 to 7\/14\/21\/28\n- Reaper Scythe has better AI now\n- Rot radius increased by 50\n- Rot Super radius reduced by 50\n- Searing Arrows Gaben replaced with: Grants Burning Army\n- Sleight of Fist no longer counts as moving to each target hit. Instead it will now travel to the center of the spell and back to the original location (these changes will only affect PA God)\n- Summon Wolves Gaben reworked to: now also summons a Big Bad Wolf (in addition to the normal wolves). Big Bad Wolf has 5x the stats of a regular wolf, and applies Howl debuff on attack.\n",
      "language": 0
    },
    {
      "timestamp": 1667797685,
      "change_description": "**2.0c**\n\n**General**\n- Posh British Announcer is now 300% louder (that's a big boy)\n- Fixed bug where people couldn't move heroes sometimes\n- Updated keywords for every spell in the game\n- Gold Quests now have better visuals\n\n**Spells**\n- Heavenly Grace AI will now correctly prioritize casting on allies\n- Ice Blast now properly prevents healing",
      "language": 0
    },
    {
      "timestamp": 1667599136,
      "change_description": "**2.0b**\n\n**General**\n\n- Fixed the long standing issue where units would randomly not attack at all\n- Fixed Rainbow Finisher to actually work\n- Updated God cards in armory to show how they are unlocked\n- Fixed Battlepass dates to show properly\n- Updated Russian Localization\n\n\n**Gods**\n\n- Chaos God deals 2% current HP per second in damage in addition to it's current effects\n- Jmuy fixed so you don't have every spell on a 1s cooldown at the start of the round\n- Selemene fixed to give the proper spell amp (was at only 10% power)\n\n\n**Spells**\n\n- Benched Tidebringer\n- Added Frostbite\n- Quill Spray casts even if there is no enemy in range\n- Fixed Jingu Mastery Buff only lasting for 3 attacks\n- Moon Glaives fixed bouncing 1 less time than it should\n- Searing Arrows Gaben no longer does literally nothing\n- Sticky Napalm Super fixed to actually work\n- Sunder AI targets closest unit in range with highest HP, rather than highest HP on board\n- Tricks of the Trade Super no longer jumps in allies",
      "language": 0
    },
    {
      "timestamp": 1667348800,
      "change_description": "**Featured**\n\n- Brand new God selection system\n- 3 New Gods (Rubick, Rune God, Chaos God)\n- 20+ New Spells\n- Private matchmaking for Immortal players now available as a beta test on our website\n- All new Season 2 Battle Pass!\n- 2 new Arenas (Phantom Assassin & Rune God)\n- New Rune God Finisher\n- More hats\n\nThis season we have simply added spells without rotating any out. This means that instead of 150 spells in the general pool, there will be 170. Each game the bans will still lower the amount of spells in each game to 100.\n\n**General**\n\n- Implemented a new God Selection system. Players will now have a random 33% of their owned Gods to choose from. You are able to reshuffle once, but can still get the same Gods again on the following selection. PLUS members will be able to discard Gods so they do not show up on the second selection screen. TLDR: The more Gods you own, the more you will be able to select from\n- Currently beta testing a matchmaking client on our website for Immortal players\n- Moved Ready Up button to make it more visible\n- Added God tabs for better visualization of buffs (ie: PA & Selemene)\n\n**Gods**\n\n- Added Rune God (unlocked via Battlepass)\nAbility: Fill Bottle\nType: Active\n\nDescription: Selected unit gains a random rune at the beginning of battle. Each shop upgrade will give more runes.\n\n- Added Rubick God (unlocked via PLUS or chest)\nAbility: Spell Steal\nType: Active\n\nDescription: Selected unit gains Spell Steal, which upgrades based on how many total spell points you have. Spell Steal does not count towards your four spell hero limit.\n\n- Added Chaos God (unlocked via Battlepass).\nAbility: ?\nType: Passive\n\nDescription: 50 magical damage per second is dealt to both allies and enemies (not lethal).  This God is temporary and will be removed from everyone's inventory at the end of the season\n\n- The Gambler is now available via PLUS or chests\n- Donkey Aghanim has been rotated out of PLUS\n- Rix, Oathbound has been rotated out of PLUS\n- Aghanim upgrade chance from 45\/50\/55\/60\/65% to 30\/35\/40\/45\/50%\n- Alchemist interest gained per gold from 1 per 10 to 1 per 11\/10\/9\/8\/7 (depends on shop level)\n- Bloodseeker lifesteal per hero death from 15% to 17.5%\n- Dazzle Shallow Grave from 0.75\/1.5\/2.25\/3\/3.75 to 0.8\/1.6\/2.4\/3.2\/4\n- Donkey Aghanim from 25% extra shop cost to 20%\n- Jmuy cooldown reduction from 0\/10\/20\/30\/40% to 10\/20\/30\/40\/50%\n- Jmuy cooldowns no longer tick down just before combat starts\n- Selemene spell amp from 0.04% to 0.03%\n- Selemene buff is now team-wide and benefits from every unit losing mana\n\n**Spells**\n\n- Added Boundless Strike\n- Added Burning Barrage\n- Added Dragons Blood\n- Added Death Ward\n- Added Duel\n- Added Enchant Totem\n- Added Epicenter\n- Added Fiends Grip\n- Added Fortunes End\n- Added Frostbite\n- Added Ice Blast\n- Added Inner Fire\n- Added Lil Shredder\n- Added Lucent Beam\n- Added Moon Glaives\n- Added Press the Attack\n- Added Pulverize\n- Added Reality Rift\n- Added Shadow Dance\n- Added Sidekick\n- Added Spear of Mars\n- Added Summon Familiars\n- Arc Lightning Gaben replaced with Grants Timeless Relic\n- Blackhole Gaben Refresher Orb now costs 0 mana\n- Blink Super CDR from 50% to 80%\n- Boundless Strike Super now also adds a perpendicular Boundless Strike at the end of the first strike\n- Boundless Strike Gaben changed to: applies Bloodthorn effect to every unit hit\n- Burrowstrike Super replaced with: applies max level Caustic Finale to units hit by Burrow\n- Chakra Magic Gaben changed to: Grants Blinding Light\n- Corrosive Haze Super now also makes it undispellable and permanent\n- Counter Helix Super now also grants Vanguard\n- Counter Helix Gaben now also grants Crimson Guard (replaces Vanguard)\n- Dark Pact Super now also causes Dark Pact to dispel enemies\n- Dark Pact Gaben replaced with: Every time the main unit casts Dark Pact, the entire team will also cast it for 50% damage\n- Empower Gaben is replaced with: casts on everyone at the start of the round (undispellable, infinite duration)\n- Firesnap Cookie cast range from 700 to 800\n- Firesnap Cookie Super now also grants Aghs Shard (max level Mortimer's Kiss puddle)\n- Frost Shield duration from 5\/6\/7\/8 to 4\/5\/6\/7\n- Frost Shield Super duration from +2s duration to +1s\n- Focus Fire Super now entirely removes damage reduction\n- Focus Fire Gaben no longer lets your auto attacks bounce\n- Focus Fire Gaben removes mana cost\n-  Impetus damage from 3.5\/7\/10.5\/14% to 4\/8\/12\/16%\n-  Impetus Super damage from +11.5% to +6%\n- Impetus Super now also grants Specialist Array\n- Ink Swell Gaben replaced with: grants 2 charges\n- Kraken Shell Gaben no longer grants Mirror Shield\n- Life Break Gaben now also grants Heaven's Halberd\n- Lucent Beam Gaben bounces from 3 to 4\n- Lucent Beam Gaben bounces deal 15% less damage per bounce\n- Nethertoxin max damage from 25\/50\/75\/100 to 15\/30\/45\/60\n- Nethertoxin super max damage from 70 to 130\n- Overload damage from 30\/50\/70\/90 to 25\/50\/75\/100\n- Pulse Nova damage from 50\/100\/150 to 60\/120\/180\n- Pulse Nova Super damage from +120 to 0\n- Pulse Nova Super now also Grants Bloodstone\n- Sharpshooter has 25% faster charge time by default\n- Sharpshooter Gaben now also grants Hunter's Boomerang\n- Split Earth Super replaced with casts level 2 Lightning Storm on every unit hit by Split Earth (can bounce)\n- Static Link Super buff duration +7s (100% uptime)\n-  Sticky Napalm Super now applies on everyone in 375 AOE of attack as well\n- Sunder Super also grants -0.2s cast point\n- Trample Gaben now also grants Sange and Kaya\n- Uproar Gaben moved to Super\n- Uproar Gaben replaced with Primal Beast's Aghs:\nWhen the hero activates Uproar, they release 3 waves of 2 projectiles per stack of uproar each in a circle around them. Projectiles deal damage and Break enemies hit. After a short delay, each projectile splinters in two\n- Vampiric Spirit Gaben also grants: when Skeletons respawn, they cast level 2 Wraithfire Blast on a random enemy (global range)\n- Wild Axes Super bonus damage from 40 to 30",
      "language": 0
    },
    {
      "timestamp": 1665800416,
      "change_description": "1.5b\n\n**General**\n\nAdded a new sound effect for when someone gets 5 or more gabens in the same game\nFixed Double Downs not showing sometimes\nFixed several tooltips\nUpdated Chinese localization\n\n**Spells**\nFixed Tricks of the Trade Super not giving Battle Fury (lol)\nFixed Searing Arrows super still giving attack range\nFixed Ancestral Spirit going to other arenas\nFixed Battle Trance sometimes preventing your hero from attacking\nFixed Plague Ward Super only showing one unit (was actually two but were on top of eachother)\nFixed Force of Nature treants spawning on top of eachother\nFixed Meat Hook hitting summons\nFixed Freezing Field super not removing after death\nFixed Magic Missile super not piercing BKB\n\n\n\n**Monetization**\nStore: Moved gods and chests to be on same line\nStore: Added tooltips for gods",
      "language": 0
    },
    {
      "timestamp": 1665098299,
      "change_description": "1.5b\n\nAttempted to fix the bug where sometimes the shop breaks while using Aghanim God\nFixed Black Hole sometimes not channeling\nAdded Double Down UI\nSome tooltips & search keywords fixed",
      "language": 0
    },
    {
      "timestamp": 1665007100,
      "change_description": "[h1]1.5 Released[\/h1]\n\nVisit http:\/\/news.abilityarena.com for the breakdown\n\n[b]Featuring[\/b]\n[list]\n[*]The Boomer God (Free)\n[*]Bloodseeker God (Free)\n[*]3 New Spells\n[*]Ready Button\n[*]New Damage\/Healing Bars\n[*]Balance\n[\/list]",
      "language": 0
    },
    {
      "timestamp": 1664405449,
      "change_description": "Removed the extra map",
      "language": 0
    },
    {
      "timestamp": 1664405370,
      "change_description": "Hotfix some of the issues introduced in the latest patches",
      "language": 0
    }
  ],
  "total": 19,
  "success": 1
}